org/20220902223205-conjugate_distributions.org
:PROPERTIES:
:ID:       985512a7-208a-4dad-90fd-1c922905aabb
:END:
#+title: Conjugate distributions

A pair of a sampling distribution and prior distribution are said to be a /conjugate pair/ if the resulting posterior distribution belongs to the same parametric family of distributions than the sampling distirbution. The prior distribution is said to be a /conjugate prior/ to the sampling distribution.

* Beta distribution

The [[id:7056fefc-93a5-44d8-a195-0dafbea354c8][Beta distribution]] is a conjugate prior to:
- Geometric
- Binomial
- Negative Binomial
- Bernoulli

* Gamma distribution

The [[id:5c34d536-2644-4386-ab72-509a274e1378][Gamma distribution]] is a conjugate prior to:
- Exponential
- Lognormal
- Poisson

  #+begin_src latex :results raw
\begin{align*}
  P(\lambda | Y=y) &= \frac{P(Y=y|\lambda) P(\lambda | \alpha, \beta)}{Z}\\
                   &= \frac{1}{Z} \frac{\lambda^y e^{-\lambda}}{y!} \frac{1}{\Gamma(\alpha)} \beta^\alpha \lambda^{\alpha-1} e^{-\beta \lambda} \\
                   &= \frac{1}{Z} \frac{1}{y! \Gamma(\alpha)} \beta^\alpha \lambda^{(\alpha+y)-1} e^{-(\beta+1) \lambda} \\
                   &= \frac{\lambda^{(\alpha+y)-1} e^{-(\beta+1) \lambda}}{Z'}\\
\end{align*}
  #+end_src

  #+RESULTS:
  \begin{align*}
    P(\lambda | Y=y) &= \frac{P(Y=y|\lambda) P(\lambda | \alpha, \beta)}{Z}\\
                     &= \frac{1}{Z} \frac{\lambda^y e^{-\lambda}}{y!} \frac{1}{\Gamma(\alpha)} \beta^\alpha \lambda^{\alpha-1} e^{-\beta \lambda} \\
                     &= \frac{1}{Z} \frac{1}{y! \Gamma(\alpha)} \beta^\alpha \lambda^{(\alpha+y)-1} e^{-(\beta+1) \lambda} \\
                     &= \frac{\lambda^{(\alpha+y)-1} e^{-(\beta+1) \lambda}}{Z'}\\
  \end{align*}

Where $Z'$ is the integral over $\lambda$ of the numerator; we recognize $\operatorname{Gamma(\alpha+y, \beta+1)}$.

- Normal
- Gamma

* Normal distribution

The [[id:1860aa41-0274-4b85-ad47-f7088753f8ce][Normal distribution]] is a conjugate prior to:
- Normal
- Lognormal
