20220902223205-conjugate_distributions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Conjugate distributions</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Conjugate distributions</h1>
<p>
A pair of a sampling distribution and prior distribution are said to be a <i>conjugate pair</i> if the resulting posterior distribution belongs to the same parametric family of distributions than the sampling distirbution. The prior distribution is said to be a <i>conjugate prior</i> to the sampling distribution.
</p>

<div id="outline-container-org7f62c28" class="outline-2">
<h2 id="org7f62c28">Beta distribution</h2>
<div class="outline-text-2" id="text-org7f62c28">
<p>
The <a href="20220902225130-beta_distribution.html#ID-7056fefc-93a5-44d8-a195-0dafbea354c8">Beta distribution</a> is a conjugate prior to:
</p>
<ul class="org-ul">
<li>Geometric</li>
<li>Binomial</li>
<li>Negative Binomial</li>
<li>Bernoulli</li>
</ul>
</div>
</div>

<div id="outline-container-org5defe7a" class="outline-2">
<h2 id="org5defe7a">Gamma distribution</h2>
<div class="outline-text-2" id="text-org5defe7a">
<p>
The <a href="20220902225150-gamma_distribution.html#ID-5c34d536-2644-4386-ab72-509a274e1378">Gamma distribution</a> is a conjugate prior to:
</p>
<ul class="org-ul">
<li>Exponential</li>
<li>Lognormal</li>
<li><p>
Poisson
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">align*</span>}
  P(<span style="color: #d73a49;">\lambda</span> | Y=y) &amp;= <span style="color: #d73a49;">\frac</span>{P(Y=y|<span style="color: #d73a49;">\lambda</span>) P(<span style="color: #d73a49;">\lambda</span> | <span style="color: #d73a49;">\alpha</span>, <span style="color: #d73a49;">\beta</span>)}{Z}<span style="color: #24292e;">\\</span>
                   &amp;= <span style="color: #d73a49;">\frac</span>{1}{Z} <span style="color: #d73a49;">\frac</span>{<span style="color: #d73a49;">\lambda</span>^y e^{-\lambda}}{y!} <span style="color: #d73a49;">\frac</span>{1}{<span style="color: #d73a49;">\Gamma</span>(<span style="color: #d73a49;">\alpha</span>)} <span style="color: #d73a49;">\beta</span>^\alpha <span style="color: #d73a49;">\lambda</span>^{\alpha-1} e^{-\beta \lambda} <span style="color: #24292e;">\\</span>
                   &amp;= <span style="color: #d73a49;">\frac</span>{1}{Z} <span style="color: #d73a49;">\frac</span>{1}{y! <span style="color: #d73a49;">\Gamma</span>(<span style="color: #d73a49;">\alpha</span>)} <span style="color: #d73a49;">\beta</span>^\alpha <span style="color: #d73a49;">\lambda</span>^{(\alpha+y)-1} e^{-(\beta+1) \lambda} <span style="color: #24292e;">\\</span>
                   &amp;= <span style="color: #d73a49;">\frac</span>{<span style="color: #d73a49;">\lambda</span>^{(\alpha+y)-1} e^{-(\beta+1) \lambda}}{Z'}<span style="color: #24292e;">\\</span>
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">align*</span>}
</pre>
</div></li>
</ul>

<p>
Where \(Z'\) is the integral over \(\lambda\) of the numerator; we recognize \(\operatorname{Gamma(\alpha+y, \beta+1)}\).
</p>

<ul class="org-ul">
<li>Normal</li>
<li>Gamma</li>
</ul>
</div>
</div>

<div id="outline-container-org1ae41ac" class="outline-2">
<h2 id="org1ae41ac">Normal distribution</h2>
<div class="outline-text-2" id="text-org1ae41ac">
<p>
The <a href="20220902230923-normal_distribution.html#ID-1860aa41-0274-4b85-ad47-f7088753f8ce">Normal distribution</a> is a conjugate prior to:
</p>
<ul class="org-ul">
<li>Normal</li>
<li>Lognormal</li>
</ul>
</div>
</div>

<div id="outline-container-org8efb918" class="outline-2">
<h2 id="org8efb918">Links to this note</h2>
</div>
</div>
</body>
</html>